step-by-step/030-populate-database/020-soap/1300-устройства-в-библиотеке/0300.xml

<?xml version="1.0" ?>
<!-- Создаем устройство в библиотеке устройств -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:deviceUpdate xmlns:common="http://common.bitel.ru"
                          xmlns:ns5="http://service.common.api.inet.modules.bgbilling.bitel.ru/"
                          xmlns:xs="http://www.w3.org/2001/XMLSchema"
                          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <arg0 xmlns="" deviceGroupIds="3" deviceTypeId="4" entityId="0" entitySpecId="1" id="-1" ident="10.252.0.32"
                  orderManagerDisabled="false" parentId="3" xsi:type="ns5:invDevice">
                <entityAttributes>
                    <entry>
                        <key>1</key>
                        <value xsi:type="ns5:entityAttrAddress"
                               flat="" floor="0" houseId="1" pod="5" room=""
                               comment="подвал" title="г. Звенигород, ул. Мира, д. 1 , п. 5, подвал">
                            <entityId>-1</entityId>
                            <entitySpecAttrId>1</entitySpecAttrId>
                            <formatKey>Обычный</formatKey>
                        </value>
                    </entry>
                </entityAttributes>
                <comment></comment>
                <config>ip.resource.categoryId=1</config>
                <host>10.252.0.32:23</host>
                <password>admin</password>
                <secret>secret</secret>
                <username>admin</username>
            </arg0>
        </ns5:deviceUpdate>
    </S:Body>
</S:Envelope>